src/test/resources/mockdata/invoices/45723_canceled.json

{
  "id": "07bb89be-dd4a-42f8-bbd0-a648e14bac5d",
  "accountingCode": "3456",
  "adjustments": [
  ],
  "adjustmentsTotal": 0.00,
  "batchGroupId": "2a2cb998-1437-41d1-88ad-01930aaeadd5",
  "currency": "USD",
  "enclosureNeeded" : false,
  "exportToAccounting": false,
  "folioInvoiceNo": "45723",
  "invoiceDate": "2018-07-20T00:00:00Z",
  "paymentMethod": "EFT",
  "status": "Cancelled",
  "source": "API",
  "subTotal": 3000.00,
  "total": 3000.00,
  "vendorInvoiceNo": "DU10938",
  "voucherNumber": "452",
  "vendorId": "13fb64dc-cdf1-11e8-a8d5-f2801f1b9fd1"
}
